In [2]:
import numpy as np
import pandas as pd

In [44]:
"""
Create a series from a list of integers representing daily temperatures (in C). Assign index labels as day of the week.
a. Find and print the avg temp of the week.
b. Identify & print the max & min temp and their respective days.
c. Display the temperatures greater than a specified value.
d. Convert all temperatures to F
e. Print the days which had temp > avg
"""

se = pd.Series([23, 25, 27, 22, 26, 30, 21], index=["Mon", "Tue", "Wed", "Thurs", "Fri", "Sat", "Sun"], dtype = float)

# Find and print the avg temp of the week.
avg = se.mean()
print(f"Average Temp of the week: {round(avg, 2)} C")

# Identify & print the max & min temp and their respective days.
print(f"\nMin Temp\n{se.nsmallest(1)}")
print(f"\nMax Temp\n{se.nlargest(1)}\n")

# Display the temperatures greater than a specified value.
spec_temp = float(input("Specify Temperature: "))
for k,v in se.items():
    if (v > spec_temp):
        print(k,v)

# d. Convert all temperatures to F
print("\nIn Fahrenheit")
print(se.apply(lambda c: c*(9/5)+32))

# e. Print the days which had temp > avg
print("\nTemperature grreater than avg")
for k,v in se.items():
    if (v > avg):
        print(k,v)

Average Temp of the week: 24.86 C

Min Temp
Sun    21.0
dtype: float64

Max Temp
Sat    30.0
dtype: float64

Specify Temperature:  25

Wed 27.0
Fri 26.0
Sat 30.0

In Fahrenheit
Mon      73.4
Tue      77.0
Wed      80.6
Thurs    71.6
Fri      78.8
Sat      86.0
Sun      69.8
dtype: float64

Temperature grreater than avg
Tue 25.0
Wed 27.0
Fri 26.0
Sat 30.0

In [121]:
"""
2. Create a data frame with details of 10 students and columns as Roll Number, Name, Gender, Marks1, Marks2, Marks3. 
    a. Create a new column with total marks 
    b. Find the lowest marks in Marks1 
    c. Find the Highest marks in Marks2 
    d. Find the average marks in Marks3 
    e. Find student name with highest average 
    f. Find how many students failed in Marks2 (<40)
"""

data = {
    "rollno": [1,2,3,4,5,6,7,8,9,10],
    "name": ["Gyanu", "Jishnu", "Vansh", "Piyush", "Tanay", "Shubh", "Vedansh", "Siddharth", "Shreya", "Gargi"],
    "gender": ["M", "M", "M", "M", "M", "M", "M", "M", "F", "F"],
    "marks1": np.random.randint(0, 101, size=10),
    "marks2": np.random.randint(0, 101, size=10),
    "marks3": np.random.randint(0, 101, size=10),
}


df = pd.DataFrame(data)

# a. Create a new column with total marks 
df["Total Marks"] = df["marks1"]+df["marks2"]+df["marks3"]

# b. Find the lowest marks in Marks1
print(f"Lowest marks in marks1: {df["marks1"].min()}")

# c. Find the Highest marks in Marks2 
print(f"Highest marks in marks2: {df["marks2"].max()}")

# d. Find the average marks in Marks3 
print(f"Highest marks in marks2: {df["marks3"].mean()}")

# e. Find student name with highest average 
print("\nHighest Average Marks")
df["Average Marks"] = df["Total Marks"]/3
print(df[df["Average Marks"] == df["Average Marks"].max()])

# f. Find how many students failed in Marks2 (<40)
print("\nStudents who failed in Subject 2")
print(df.query("marks2 < 40"))

df

Lowest marks in marks1: 31
Highest marks in marks2: 80
Highest marks in marks2: 53.0

Highest Average Marks
   rollno   name gender  marks1  marks2  marks3  Total Marks  Average Marks
0       1  Gyanu      M      94      21      96          211      70.333333

Students who failed in Subject 2
   rollno    name gender  marks1  marks2  marks3  Total Marks  Average Marks
0       1   Gyanu      M      94      21      96          211      70.333333
1       2  Jishnu      M      93      22      94          209      69.666667
8       9  Shreya      F      85      26      39          150      50.000000

,rollno,name,gender,marks1,marks2,marks3,Total Marks,Average Marks
0,1,Gyanu,M,94,21,96,211,70.333333
1,2,Jishnu,M,93,22,94,209,69.666667
2,3,Vansh,M,69,63,68,200,66.666667
3,4,Piyush,M,31,51,78,160,53.333333
4,5,Tanay,M,68,78,39,185,61.666667
5,6,Shubh,M,51,59,24,134,44.666667
6,7,Vedansh,M,65,80,42,187,62.333333
7,8,Siddharth,M,71,66,31,168,56.000000
8,9,Shreya,F,85,26,39,150,50.000000
9,10,Gargi,F,70,75,19,164,54.666667